In [1]:
import pandas as pd
import datetime as dt

In [2]:
dataset = pd.read_csv("potus_visitors_2015.csv")
dataset

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,1/6/2015 9:30,1/6/2015 23:59,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,1/6/2015 9:30,1/6/2015 23:59,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,1/6/2015 9:30,1/6/2015 23:59,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,1/6/2015 9:30,1/6/2015 23:59,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,1/6/2015 9:30,1/6/2015 23:59,NaN,potus,west wing,JointService Military Honor Guard
...,...,...,...,...,...,...,...,...
47949,William B. Henline,2015-12-16T00:00:00,12/18/2015 16:30,12/18/2015 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47950,Ian T. Burris,2015-12-16T00:00:00,12/18/2015 16:30,12/18/2015 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47951,James F. Albaugh,2015-12-16T00:00:00,12/18/2015 16:30,12/18/2015 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47952,Jackie L. Finken,2015-12-16T00:00:00,12/18/2015 16:30,12/18/2015 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47953,Grace M. Bauman,2015-12-16T00:00:00,12/18/2015 16:30,12/18/2015 23:59,NaN,POTUS/FLOTUS,State Floo,NaN

In [3]:
header = dataset.columns

In [4]:
header

Index(['name', 'appt_made_date', 'appt_start_date', 'appt_end_date',
       'visitee_namelast', 'visitee_namefirst', 'meeting_room', 'description'],
      dtype='object')

In [5]:
dataset.columns

Index(['name', 'appt_made_date', 'appt_start_date', 'appt_end_date',
       'visitee_namelast', 'visitee_namefirst', 'meeting_room', 'description'],
      dtype='object')

In [6]:
dataset.head()

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
0,Joshua T. Blanton,2014-12-18T00:00:00,1/6/2015 9:30,1/6/2015 23:59,NaN,potus,west wing,JointService Military Honor Guard
1,Jack T. Gutting,2014-12-18T00:00:00,1/6/2015 9:30,1/6/2015 23:59,NaN,potus,west wing,JointService Military Honor Guard
2,Bradley T. Guiles,2014-12-18T00:00:00,1/6/2015 9:30,1/6/2015 23:59,NaN,potus,west wing,JointService Military Honor Guard
3,Loryn F. Grieb,2014-12-18T00:00:00,1/6/2015 9:30,1/6/2015 23:59,NaN,potus,west wing,JointService Military Honor Guard
4,Travis D. Gordon,2014-12-18T00:00:00,1/6/2015 9:30,1/6/2015 23:59,NaN,potus,west wing,JointService Military Honor Guard

In [7]:
dataset.tail()

,name,appt_made_date,appt_start_date,appt_end_date,visitee_namelast,visitee_namefirst,meeting_room,description
47949,William B. Henline,2015-12-16T00:00:00,12/18/2015 16:30,12/18/2015 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47950,Ian T. Burris,2015-12-16T00:00:00,12/18/2015 16:30,12/18/2015 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47951,James F. Albaugh,2015-12-16T00:00:00,12/18/2015 16:30,12/18/2015 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47952,Jackie L. Finken,2015-12-16T00:00:00,12/18/2015 16:30,12/18/2015 23:59,NaN,POTUS/FLOTUS,State Floo,NaN
47953,Grace M. Bauman,2015-12-16T00:00:00,12/18/2015 16:30,12/18/2015 23:59,NaN,POTUS/FLOTUS,State Floo,NaN

In [8]:
dataset['appt_start_date'].tail(1)

47953    12/18/2015 16:30
Name: appt_start_date, dtype: object

In [9]:
dataset['appt_start_date']

0           1/6/2015 9:30
1           1/6/2015 9:30
2           1/6/2015 9:30
3           1/6/2015 9:30
4           1/6/2015 9:30
               ...
47949    12/18/2015 16:30
47950    12/18/2015 16:30
47951    12/18/2015 16:30
47952    12/18/2015 16:30
47953    12/18/2015 16:30
Name: appt_start_date, Length: 47954, dtype: object

In [10]:
date_format = '%m/%d/%Y %H:%M'

In [11]:
start_date = dataset['appt_start_date']
start_date

0           1/6/2015 9:30
1           1/6/2015 9:30
2           1/6/2015 9:30
3           1/6/2015 9:30
4           1/6/2015 9:30
               ...
47949    12/18/2015 16:30
47950    12/18/2015 16:30
47951    12/18/2015 16:30
47952    12/18/2015 16:30
47953    12/18/2015 16:30
Name: appt_start_date, Length: 47954, dtype: object

In [12]:
dataset['appt_start_date'] = pd.to_datetime(start_date,format=date_format)

In [13]:
dataset['appt_start_date']

0       2015-01-06 09:30:00
1       2015-01-06 09:30:00
2       2015-01-06 09:30:00
3       2015-01-06 09:30:00
4       2015-01-06 09:30:00
                ...
47949   2015-12-18 16:30:00
47950   2015-12-18 16:30:00
47951   2015-12-18 16:30:00
47952   2015-12-18 16:30:00
47953   2015-12-18 16:30:00
Name: appt_start_date, Length: 47954, dtype: datetime64[ns]

In [14]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47954 entries, 0 to 47953
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   name               47954 non-null  object
 1   appt_made_date     47954 non-null  object
 2   appt_start_date    47954 non-null  datetime64[ns]
 3   appt_end_date      47954 non-null  object
 4   visitee_namelast   6069 non-null   object
 5   visitee_namefirst  47953 non-null  object
 6   meeting_room       47954 non-null  object
 7   description        8053 non-null   object
dtypes: datetime64[ns](1), object(7)
memory usage: 2.9+ MB

In [15]:
dis = dataset['appt_start_date']
dis

0       2015-01-06 09:30:00
1       2015-01-06 09:30:00
2       2015-01-06 09:30:00
3       2015-01-06 09:30:00
4       2015-01-06 09:30:00
                ...
47949   2015-12-18 16:30:00
47950   2015-12-18 16:30:00
47951   2015-12-18 16:30:00
47952   2015-12-18 16:30:00
47953   2015-12-18 16:30:00
Name: appt_start_date, Length: 47954, dtype: datetime64[ns]

In [ ]:
dataset["app_start_date_in_text"] = dis.dt.strftime("%Y-%B-%A at %H")
dataset

In [ ]:
dir(pd)

In [ ]:
dataset[['appt_start_date','app_start_date_in_text']]

In [ ]:
dataset.info()

In [ ]:
dataset.isnull().sum()

In [ ]:
dataset['description'].isnull().sum()

In [ ]:
dataset['description'].unique

In [ ]:
dataset['description'] = dataset['description'].fillna("description not required").replace("NAN","description not required")
dataset['description']

In [ ]:
for i in dataset['description']:
    print(i)

In [ ]:
pd.set_option('display.max_rows', None)

In [ ]:
dataset['description']

In [ ]:
dataset.info()

In [ ]:
dataset[dataset['visitee_namelast'].isnull()]

In [ ]:
dataset.visitee_namelast.unique()

In [ ]:
dataset['visitee_namelast'] = dataset['visitee_namelast'].fillna('unknown').replace('None', 'unknown').replace('/','unknown')

In [ ]:
dataset['visitee_namelast']

In [ ]:
dataset['visitee_namelast'].unique()

In [ ]:
dataset

In [ ]:
dataset.info()